Praktika_Turina_2025/src/Documents/ДоговорНаОказаниеПлатныхУслуг/ДоговорНаОказаниеПлатныхУслуг.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ДоговорНаОказаниеПлатныхУслуг</name>
  <registerRecords>InformationRegister.УслугиДОППоДетям</registerRecords>
  <attributes>
    <name>НомерДоговора</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ФИОРебенка</name>
    <type>
      <types>CatalogRef.Дети</types>
    </type>
  </attributes>
  <attributes>
    <name>Адрес</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ФИОРодителя</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>70</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаНачала</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОкончания</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ЭтоДополнительноеСоглашение</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>СвязанныйДоговор</name>
    <type>
      <types>DocumentRef.ДоговорНаОказаниеПлатныхУслуг</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ТабДок</name>
    <attributes>
      <name>НаименованиеДОП</name>
      <type>
        <types>CatalogRef.ПлатныеУслуги</types>
      </type>
    </attributes>
    <attributes>
      <name>ФормаОбучения</name>
      <type>
        <types>EnumRef.ФормаОбучения</types>
      </type>
    </attributes>
    <attributes>
      <name>Направленность</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>200</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоЧасовВНеделю</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СтоимостьОдногоЗанятия</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

Praktika_Turina_2025/src/InformationRegisters/УслугиДОППоДетям/УслугиДОППоДетям.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>УслугиДОППоДетям</name>
  <informationRegisterPeriodicity>Day</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>ДатаЗачисленияОтчисления</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Ребенок</name>
    <type>
      <types>CatalogRef.Дети</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Услуга</name>
    <type>
      <types>CatalogRef.ПлатныеУслуги</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Операция</name>
    <type>
      <types>EnumRef.ОперацииУслуг</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Praktika_Turina_2025/src/Documents/ДоговорНаОказаниеПлатныхУслуг/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	#Область ОбработчикиСобытий
	Процедура ОбработкаПроведения(Отказ, Режим)
		// регистр УслугиДОППоДетям
		Движения.УслугиДОППоДетям.Записывать = Истина;
		Для Каждого ТекСтрокаТабДок Из ТабДок Цикл
			Движение = Движения.УслугиДОППоДетям.Добавить();
			Движение.Период = Дата;
			Движение.Ребенок = ФИОРебенка;
			Движение.Услуга = ТекСтрокаТабДок.НаименованиеДОП;
			Движение.Операция = Перечисления.ОперацииУслуг.Зачисление;
			Движение.ДатаЗачисленияОтчисления = Дата;
		КонецЦикла;
	КонецПроцедуры
	
	Процедура ПередЗаписью(Отказ)
		Если ЭтотОбъект.ЭтоДополнительноеСоглашение = Истина Тогда
			Если Не ЗначениеЗаполнено(ЭтотОбъект.СвязанныйДоговор) Тогда
				Отказ = Истина;
				Сообщить("Для дополнительного соглашения должен быть указан связанный договор");
			ИначеЕсли ЭтотОбъект.ФИОРебенка <> ЭтотОбъект.СвязанныйДоговор.ФИОРебенка Тогда
				Отказ = Истина;
				Сообщение = Новый СообщениеПользователю();
				Сообщение.Текст = НСтр("ru = 'Ребенок в договоре и дополнительном соглашении должен совпадать'");
			КонецЕсли;
		КонецЕсли;
		Если ЭтотОбъект.ТабДок.Количество() = 0 Тогда
			Отказ = Истина;
			Сообщение = Новый СообщениеПользователю();
			Сообщение.Текст = НСтр("ru = 'Укажите хотя бы одну ДОП.'");
			Сообщение.Сообщить();
		КонецЕсли;		
	КонецПроцедуры
	#КонецОбласти	
#КонецЕсли
